Signant API/Signant API/OpenAPIs/PostingsService.svc

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="PostingsService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsp:Policy wsu:Id="BasicHttpBinding_IPostingsService_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xsd:schema targetNamespace="http://tempuri.org/Imports"><xsd:import schemaLocation="https://test3.signant.no/WS/V1/PostingsService.svc?xsd=xsd0" namespace="http://tempuri.org/"/><xsd:import schemaLocation="https://test3.signant.no/WS/V1/PostingsService.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="https://test3.signant.no/WS/V1/PostingsService.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/Signant.Common.Models"/><xsd:import schemaLocation="https://test3.signant.no/WS/V1/PostingsService.svc?xsd=xsd3" namespace="http://schemas.datacontract.org/2004/07/Signant.Global.Common.Enums"/></xsd:schema></wsdl:types><wsdl:message name="IPostingsService_GetPostingStatus_InputMessage"><wsdl:part name="parameters" element="tns:GetPostingStatus"/></wsdl:message><wsdl:message name="IPostingsService_GetPostingStatus_OutputMessage"><wsdl:part name="parameters" element="tns:GetPostingStatusResponse"/></wsdl:message><wsdl:message name="IPostingsService_GetSignPostingStatusDetails_InputMessage"><wsdl:part name="parameters" element="tns:GetSignPostingStatusDetails"/></wsdl:message><wsdl:message name="IPostingsService_GetSignPostingStatusDetails_OutputMessage"><wsdl:part name="parameters" element="tns:GetSignPostingStatusDetailsResponse"/></wsdl:message><wsdl:message name="IPostingsService_GetSignPostingStatusDetailsV2_InputMessage"><wsdl:part name="parameters" element="tns:GetSignPostingStatusDetailsV2"/></wsdl:message><wsdl:message name="IPostingsService_GetSignPostingStatusDetailsV2_OutputMessage"><wsdl:part name="parameters" element="tns:GetSignPostingStatusDetailsV2Response"/></wsdl:message><wsdl:message name="IPostingsService_DeletePosting_InputMessage"><wsdl:part name="parameters" element="tns:DeletePosting"/></wsdl:message><wsdl:message name="IPostingsService_DeletePosting_OutputMessage"><wsdl:part name="parameters" element="tns:DeletePostingResponse"/></wsdl:message><wsdl:message name="IPostingsService_CreateSignPosting_InputMessage"><wsdl:part name="parameters" element="tns:CreateSignPosting"/></wsdl:message><wsdl:message name="IPostingsService_CreateSignPosting_OutputMessage"><wsdl:part name="parameters" element="tns:CreateSignPostingResponse"/></wsdl:message><wsdl:message name="IPostingsService_CreateSignPostingWithToken_InputMessage"><wsdl:part name="parameters" element="tns:CreateSignPostingWithToken"/></wsdl:message><wsdl:message name="IPostingsService_CreateSignPostingWithToken_OutputMessage"><wsdl:part name="parameters" element="tns:CreateSignPostingWithTokenResponse"/></wsdl:message><wsdl:message name="IPostingsService_DownloadAttachment_InputMessage"><wsdl:part name="parameters" element="tns:DownloadAttachment"/></wsdl:message><wsdl:message name="IPostingsService_DownloadAttachment_OutputMessage"><wsdl:part name="parameters" element="tns:DownloadAttachmentResponse"/></wsdl:message><wsdl:message name="IPostingsService_GetAuthenticationToken_InputMessage"><wsdl:part name="parameters" element="tns:GetAuthenticationToken"/></wsdl:message><wsdl:message name="IPostingsService_GetAuthenticationToken_OutputMessage"><wsdl:part name="parameters" element="tns:GetAuthenticationTokenResponse"/></wsdl:message><wsdl:message name="IPostingsService_GetUserInfoByTokenID_InputMessage"><wsdl:part name="parameters" element="tns:GetUserInfoByTokenID"/></wsdl:message><wsdl:message name="IPostingsService_GetUserInfoByTokenID_OutputMessage"><wsdl:part name="parameters" element="tns:GetUserInfoByTokenIDResponse"/></wsdl:message><wsdl:portType name="IPostingsService"><wsdl:operation name="GetPostingStatus"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/GetPostingStatus" message="tns:IPostingsService_GetPostingStatus_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/GetPostingStatusResponse" message="tns:IPostingsService_GetPostingStatus_OutputMessage"/></wsdl:operation><wsdl:operation name="GetSignPostingStatusDetails"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/GetSignPostingStatusDetails" message="tns:IPostingsService_GetSignPostingStatusDetails_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/GetSignPostingStatusDetailsResponse" message="tns:IPostingsService_GetSignPostingStatusDetails_OutputMessage"/></wsdl:operation><wsdl:operation name="GetSignPostingStatusDetailsV2"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/GetSignPostingStatusDetailsV2" message="tns:IPostingsService_GetSignPostingStatusDetailsV2_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/GetSignPostingStatusDetailsV2Response" message="tns:IPostingsService_GetSignPostingStatusDetailsV2_OutputMessage"/></wsdl:operation><wsdl:operation name="DeletePosting"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/DeletePosting" message="tns:IPostingsService_DeletePosting_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/DeletePostingResponse" message="tns:IPostingsService_DeletePosting_OutputMessage"/></wsdl:operation><wsdl:operation name="CreateSignPosting"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/CreateSignPosting" message="tns:IPostingsService_CreateSignPosting_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/CreateSignPostingResponse" message="tns:IPostingsService_CreateSignPosting_OutputMessage"/></wsdl:operation><wsdl:operation name="CreateSignPostingWithToken"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/CreateSignPostingWithToken" message="tns:IPostingsService_CreateSignPostingWithToken_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/CreateSignPostingWithTokenResponse" message="tns:IPostingsService_CreateSignPostingWithToken_OutputMessage"/></wsdl:operation><wsdl:operation name="DownloadAttachment"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/DownloadAttachment" message="tns:IPostingsService_DownloadAttachment_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/DownloadAttachmentResponse" message="tns:IPostingsService_DownloadAttachment_OutputMessage"/></wsdl:operation><wsdl:operation name="GetAuthenticationToken"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/GetAuthenticationToken" message="tns:IPostingsService_GetAuthenticationToken_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/GetAuthenticationTokenResponse" message="tns:IPostingsService_GetAuthenticationToken_OutputMessage"/></wsdl:operation><wsdl:operation name="GetUserInfoByTokenID"><wsdl:input wsaw:Action="http://tempuri.org/IPostingsService/GetUserInfoByTokenID" message="tns:IPostingsService_GetUserInfoByTokenID_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IPostingsService/GetUserInfoByTokenIDResponse" message="tns:IPostingsService_GetUserInfoByTokenID_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IPostingsService" type="tns:IPostingsService"><wsp:PolicyReference URI="#BasicHttpBinding_IPostingsService_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetPostingStatus"><soap:operation soapAction="http://tempuri.org/IPostingsService/GetPostingStatus" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetSignPostingStatusDetails"><soap:operation soapAction="http://tempuri.org/IPostingsService/GetSignPostingStatusDetails" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetSignPostingStatusDetailsV2"><soap:operation soapAction="http://tempuri.org/IPostingsService/GetSignPostingStatusDetailsV2" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="DeletePosting"><soap:operation soapAction="http://tempuri.org/IPostingsService/DeletePosting" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CreateSignPosting"><soap:operation soapAction="http://tempuri.org/IPostingsService/CreateSignPosting" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CreateSignPostingWithToken"><soap:operation soapAction="http://tempuri.org/IPostingsService/CreateSignPostingWithToken" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="DownloadAttachment"><soap:operation soapAction="http://tempuri.org/IPostingsService/DownloadAttachment" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetAuthenticationToken"><soap:operation soapAction="http://tempuri.org/IPostingsService/GetAuthenticationToken" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetUserInfoByTokenID"><soap:operation soapAction="http://tempuri.org/IPostingsService/GetUserInfoByTokenID" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="PostingsService"><wsdl:port name="BasicHttpBinding_IPostingsService" binding="tns:BasicHttpBinding_IPostingsService"><soap:address location="https://test3.signant.no/WS/V1/PostingsService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>